- drop_duplicates, Logic in Python(and, or, not 등 연산 이해하기)
- head, tail로 데이터 미리보기 - sample(), nlargest, nsmallest
- 일부 컬럼 기준으로 데이터 가져오기

In [13]:
import pandas as pd
import numpy as np
import seaborn as sns

In [14]:
df = pd.DataFrame([[1,2,3,np.nan],[2,35,5,np.nan],[5,np.nan,6,8]], index = range(1,4),columns = ['a','b','c','d'])
df

   a     b  c    d
1  1   2.0  3  NaN
2  2  35.0  5  NaN
3  5   NaN  6  8.0

In [15]:
df2 = pd.DataFrame({'a':[1,2,3],'b':[4,5,6],'c':[6,7,8]},index = pd.MultiIndex.from_tuples([('e',1),('e',2),('d',2)],names=['n','v']))

In [16]:
#중복된 로우 삭제
df2.drop_duplicates(keep='last')
df2

     a  b  c
n v
e 1  1  4  6
  2  2  5  7
d 2  3  6  8

In [17]:
df2[df2['c'] != 7]

     a  b  c
n v
e 1  1  4  6
d 2  3  6  8

In [18]:
df2[df2.a.isin([3])]#df.column명.isin(list형태)

     a  b  c
n v
d 2  3  6  8

In [19]:
pd.isnull(df)

       a      b      c      d
1  False  False  False   True
2  False  False  False   True
3  False   True  False  False

In [20]:
df['d'].isnull().sum()

2

In [21]:
df['c'].notnull().sum()

3

In [22]:
df.b.notnull()

1     True
2     True
3    False
Name: b, dtype: bool

In [23]:
~df2.all()

a    False
b    False
c    False
dtype: bool

In [25]:
df[df.c.notnull()]

   a     b  c    d
1  1   2.0  3  NaN
2  2  35.0  5  NaN
3  5   NaN  6  8.0

In [26]:
df2.sample(frac=0.5)#랜덤으로 1개의 열 가져옴 frac =0.3이면 30퍼센트개수

     a  b  c
n v
e 1  1  4  6
  2  2  5  7

In [27]:
df.nlargest(1,'a')#'a'컬럼에서 가장 큰 값 1개 불러옴

   a   b  c    d
3  5 NaN  6  8.0

In [28]:
df2.nsmallest(2,'b')#'b'컬럼에서 가장 작은 값 2개 불러옴

     a  b  c
n v
e 1  1  4  6
  2  2  5  7

In [29]:
df2.iloc[-3:]

     a  b  c
n v
e 1  1  4  6
  2  2  5  7
d 2  3  6  8

In [30]:
dat = sns.load_dataset('iris')#내장 데이터셋
dat.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [31]:
#특정 컬럼 가져오기
col = ['sepal_length', 'sepal_width','petal_length']
dat[col].tail()

     sepal_length  sepal_width  petal_length
145           6.7          3.0           5.2
146           6.3          2.5           5.0
147           6.5          3.0           5.2
148           6.2          3.4           5.4
149           5.9          3.0           5.1

In [32]:
# .을 이용하는 방법은 특수문자, 한글은 지원안됨
dat.sepal_width.head()

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal_width, dtype: float64

In [33]:
dat.filter(regex = '_').head()#정규표현식 조건 : _가 들어가는 컬럼불러오기

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [34]:
dat.filter(regex='^sepal').head()#sepal로 시작하는 컬럼

   sepal_length  sepal_width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

In [35]:
dat.filter(regex='th$').head()#th로 끝나는 컬럼

   sepal_length  sepal_width  petal_length  petal_width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2

In [36]:
dat.loc[:3,'sepal_width':'petal_length']

   sepal_width  petal_length
0          3.5           1.4
1          3.0           1.4
2          3.2           1.3
3          3.1           1.5

In [37]:
dat.iloc[:3,[1,2]]#loc은 :3하면 3포함, iloc은 3미포함

   sepal_width  petal_length
0          3.5           1.4
1          3.0           1.4
2          3.2           1.3

In [38]:
dat.loc[dat['sepal_length']>4.5, ['sepal_width']].head()#조건걸고 행,열지정

   sepal_width
0          3.5
1          3.0
2          3.2
3          3.1
4          3.6